<h1>***Pandas/ matplotlib practice field***</h1>

<img src="http://www.dataschool.io/content/images/2016/05/python_pandas.jpg"
style="width:500px;height:260px">
***
Reference website [10 minutes to pandas]( https://pandas.pydata.org/pandas-docs/stable/10min.html)

***
<h4> library import zone </h4>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

------
*Create a Series by passing a list of values*
>  Function  
>  **pd.series()**  
>  **pd.date_range()**

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
?pd.Series

In [5]:
dates = pd.date_range('20130101', periods = 6 )

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

***
*Create a DataFrame by passing a numpy array*

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01 -0.272551  1.159361  0.472663  0.663716
2013-01-02 -0.675158 -2.398506 -0.390429  1.073241
2013-01-03 -1.369465 -0.405796 -0.440801  0.392865
2013-01-04 -0.349570  0.257545  0.698213  0.535524
2013-01-05  0.440265 -0.544056 -1.749923  1.550461
2013-01-06 -0.680083  0.576767 -0.000537  0.496281

In [9]:
?np.random.randn

<hr />
_Viewing Datum_

In [10]:
df.head(1)

                   A         B         C         D
2013-01-01 -0.272551  1.159361  0.472663  0.663716

In [11]:
df.tail(4)

                   A         B         C         D
2013-01-03 -1.369465 -0.405796 -0.440801  0.392865
2013-01-04 -0.349570  0.257545  0.698213  0.535524
2013-01-05  0.440265 -0.544056 -1.749923  1.550461
2013-01-06 -0.680083  0.576767 -0.000537  0.496281

***
***Display the index, columns and the underlying numpy data***

In [12]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.values

array([[-2.72551177e-01,  1.15936059e+00,  4.72662738e-01,
         6.63716398e-01],
       [-6.75157899e-01, -2.39850616e+00, -3.90429036e-01,
         1.07324101e+00],
       [-1.36946511e+00, -4.05795741e-01, -4.40801185e-01,
         3.92865326e-01],
       [-3.49569747e-01,  2.57545191e-01,  6.98213109e-01,
         5.35523808e-01],
       [ 4.40264736e-01, -5.44055711e-01, -1.74992335e+00,
         1.55046098e+00],
       [-6.80082697e-01,  5.76766637e-01, -5.37456791e-04,
         4.96280992e-01]])

#### Quick statistic summary of data

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.484427 -0.225781 -0.235136  0.785348
std    0.596001  1.236992  0.870420  0.443416
min   -1.369465 -2.398506 -1.749923  0.392865
25%   -0.678851 -0.509491 -0.428208  0.506092
50%   -0.512364 -0.074125 -0.195483  0.599620
75%   -0.291806  0.496961  0.354363  0.970860
max    0.440265  1.159361  0.698213  1.550461

#### Transposing the data

In [16]:
df

                   A         B         C         D
2013-01-01 -0.272551  1.159361  0.472663  0.663716
2013-01-02 -0.675158 -2.398506 -0.390429  1.073241
2013-01-03 -1.369465 -0.405796 -0.440801  0.392865
2013-01-04 -0.349570  0.257545  0.698213  0.535524
2013-01-05  0.440265 -0.544056 -1.749923  1.550461
2013-01-06 -0.680083  0.576767 -0.000537  0.496281

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.272551   -0.675158   -1.369465   -0.349570    0.440265   -0.680083
B    1.159361   -2.398506   -0.405796    0.257545   -0.544056    0.576767
C    0.472663   -0.390429   -0.440801    0.698213   -1.749923   -0.000537
D    0.663716    1.073241    0.392865    0.535524    1.550461    0.496281

### Create a DataFrame by passing a dict of objects that can be converted to series-like

In [18]:
df2 = pd.DataFrame({ 'A' : 1.,
   ....:             'B' : pd.Timestamp('20130102'),
   ....:             'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:             'D' : np.array([3] * 4,dtype='int32'),
   ....:             'E' : pd.Categorical(["test","train","test","train"]),
   ....:             'F' : 'foo' })

In [19]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [20]:
?pd.Timestamp()

In [21]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

##  *Selection

#### column

In [22]:
df[ 'A']

2013-01-01   -0.272551
2013-01-02   -0.675158
2013-01-03   -1.369465
2013-01-04   -0.349570
2013-01-05    0.440265
2013-01-06   -0.680083
Freq: D, Name: A, dtype: float64

#### raws

In [23]:
df[ 0:4 ]

                   A         B         C         D
2013-01-01 -0.272551  1.159361  0.472663  0.663716
2013-01-02 -0.675158 -2.398506 -0.390429  1.073241
2013-01-03 -1.369465 -0.405796 -0.440801  0.392865
2013-01-04 -0.349570  0.257545  0.698213  0.535524

In [24]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.675158 -2.398506 -0.390429  1.073241
2013-01-03 -1.369465 -0.405796 -0.440801  0.392865
2013-01-04 -0.349570  0.257545  0.698213  0.535524

![Markdown](http://mikemclin.net/mmwp/wp-content/uploads/2013/03/markdown-syntax-language.png)

***Markdown practice***

***
+ **linkage**  
The reference website is [Markdown Guide][1]

[1]: https://media.readthedocs.org/pdf/markdown-guide/latest/markdown-guide.pdf

+ **line break**  
Forcing a line-break
next line in the list
        'i= i+2'
        'hex(234)'
        !import aab'

* **Create Simple list**
    + one
        - side one
    - Two
    * Three